{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing phone-number related updates and affected frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend React components and config files.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark mode tokens, and base styles.",
  "frontend/index.html": "HTML entry file loading the React app root and favicon with meta tags.",
  "frontend/src/App.tsx": "Main React component composing all site sections plus header, footer, and WhatsApp button.",
  "frontend/src/components/king-kingdom/contact/PhoneNumberLinks.tsx": "Component rendering all configured phone numbers as tel links with optional icon and separator.",
  "frontend/src/components/king-kingdom/cta/CallNowButton.tsx": "CTA button linking to the primary configured phone number for call actions.",
  "frontend/src/components/king-kingdom/cta/WhatsAppButton.tsx": "Button component linking to the configured WhatsApp URL with primary and outline variants.",
  "frontend/src/components/king-kingdom/FloatingWhatsAppButton.tsx": "Floating WhatsApp button linking to the configured WhatsApp URL.",
  "frontend/src/components/king-kingdom/Footer.tsx": "Footer showing company info, social links, quick navigation, and phone numbers from config.",
  "frontend/src/components/king-kingdom/HeaderNav.tsx": "Sticky header with smooth-scroll navigation, mobile menu, and CTA buttons.",
  "frontend/src/components/king-kingdom/sections/AboutSection.tsx": "Renders an about section describing the company, its mission, vision, and values in styled cards.",
  "frontend/src/components/king-kingdom/sections/ConstructionPhotosSection.tsx": "Displays a gallery of construction photos using a grid of hover-animated image cards.",
  "frontend/src/components/king-kingdom/sections/ContactSection.tsx": "Provides company contact info and a form that opens WhatsApp with a prefilled message on submit.",
  "frontend/src/components/king-kingdom/sections/HeroSection.tsx": "Hero section with main heading, CTAs, scroll-to-section buttons, and a feature list card.",
  "frontend/src/components/king-kingdom/sections/HighlightsSection.tsx": "Shows four highlight cards summarizing key strengths such as quality and on‑time delivery.",
  "frontend/src/components/king-kingdom/sections/ProcessSection.tsx": "Outlines the company’s six‑step workflow in a grid of numbered cards.",
  "frontend/src/components/king-kingdom/sections/ProjectsSection.tsx": "Displays a portfolio grid of project images with titles and locations.",
  "frontend/src/components/king-kingdom/sections/ServicesSection.tsx": "Lists the company’s service offerings with icons, titles, and short descriptions.",
  "frontend/src/components/king-kingdom/sections/WhyChooseSection.tsx": "Lists reasons to choose the company using icon cards on a navy gradient background.",
  "frontend/src/components/king-kingdom/TopBar.tsx": "Top bar displaying phone numbers, WhatsApp link, email, and address.",
  "frontend/src/config/contact.ts": "Exports centralized contact details including phones, WhatsApp info, email, and address.",
  "frontend/src/config/socialLinks.ts": "Defines social link types and a list of platform URLs, plus a helper that filters links with valid URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for managing login, stored identities, and authentication state.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, component classes, and utilities for the app’s design system.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/lib/whatsapp.ts": "Builds and opens WhatsApp message URLs using the central contact config.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, shadows, animations, and enabling plugins.",
  "project_state.json": "Tracks project metadata, existing features, pending requests, and project structure state."
}