{
  "backend/main.mo": "Actor stores contact info and lead forms, provides query methods to fetch them, and a shared function to submit new leads.",
  "feature_evidence.json": "Defines feature evidence entries listing required UI updates, affected files, and associated components and tests.",
  "frontend-file-summaries.txt": "Contains short summaries of all frontend files describing their purpose and UI behavior.",
  "frontend/index.css": "Tailwind base layer defining global OKLCH color tokens and theming for light and dark modes.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and mounting the React app.",
  "frontend/src/App.tsx": "Main app component rendering TopBar, navigation, all page sections, footer, and a floating WhatsApp button.",
  "frontend/src/components/king-kingdom/contact/PhoneNumberLinks.tsx": "Displays all phone numbers as clickable links with optional icon and separator.",
  "frontend/src/components/king-kingdom/cta/CallNowButton.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/king-kingdom/cta/WhatsAppButton.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/king-kingdom/FloatingWhatsAppButton.tsx": "Fixed WhatsApp button linking to configured WhatsApp URL with icon and hover animation.",
  "frontend/src/components/king-kingdom/Footer.tsx": "Footer showing branding, quick links, contact details, and social icons using centralized contact and social config.",
  "frontend/src/components/king-kingdom/HeaderNav.tsx": "Sticky responsive header with navigation links, CTAs, scroll handling, and mobile menu.",
  "frontend/src/components/king-kingdom/sections/AboutSection.tsx": "Shows information about the company, including who they are, their promise, vision, mission, and values.",
  "frontend/src/components/king-kingdom/sections/ConstructionPhotosSection.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/king-kingdom/sections/ContactSection.tsx": "Provides a contact form with validation and displays address, phone, WhatsApp, and email details.",
  "frontend/src/components/king-kingdom/sections/HeroSection.tsx": "Hero section with headline, description, scroll-to-section buttons, and services list.",
  "frontend/src/components/king-kingdom/sections/HighlightsSection.tsx": "Shows four highlight cards describing key company strengths.",
  "frontend/src/components/king-kingdom/sections/MaterialsSection.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/king-kingdom/sections/PortfolioSection.tsx": "Displays a grid of sample project cards with titles and locations.",
  "frontend/src/components/king-kingdom/sections/ProcessSection.tsx": "Outlines the six-step workflow from initial contact to project handover.",
  "frontend/src/components/king-kingdom/sections/ProjectsSection.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/king-kingdom/sections/ServicesSection.tsx": "Lists construction-related services in a responsive grid.",
  "frontend/src/components/king-kingdom/sections/WhyChooseSection.tsx": "Shows reasons to choose the company, each with an icon, title, and description.",
  "frontend/src/components/king-kingdom/TopBar.tsx": "Renders a top bar showing phone numbers, WhatsApp, email, hours, and address using CONTACT_INFO.",
  "frontend/src/config/contact.ts": "Exports all contact details including phones, WhatsApp, email, address, and hours.",
  "frontend/src/config/socialLinks.ts": "Defines social media link objects and a helper to return only entries with valid URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and initializes AuthClient with stored identities.",
  "frontend/src/index.css": "Tailwind CSS base, components, and utilities with custom theme variables for the King Kingdom design.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/lib/whatsapp.ts": "Builds and opens WhatsApp URLs using configured contact info.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, shadows, animations, and other theme settings.",
  "project_state.json": "Stores project metadata, features, and pending requests for the King Kingdom project."
}