{
  "backend/main.mo": "Motoko actor storing lead forms, exposing queries for contact details and lead retrieval plus a submission method.",
  "feature_evidence.json": "Lists feature evidence entries referencing frontend files for logo, favicon, and UI changes.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend components and utilities.",
  "frontend/index.css": "Tailwind base/theme variable definitions with light/dark mode CSS custom properties.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app without a favicon reference.",
  "frontend/src/App.tsx": "Main React component assembling all King Kingdom sections, footer, and floating WhatsApp button.",
  "frontend/src/components/king-kingdom/contact/PhoneNumberLinks.tsx": "Displays a list of clickable phone numbers with optional icon and separator.",
  "frontend/src/components/king-kingdom/cta/CallNowButton.tsx": "Empty placeholder file for a call‑to‑action button component.",
  "frontend/src/components/king-kingdom/cta/WhatsAppButton.tsx": "Empty placeholder file for a WhatsApp CTA button component.",
  "frontend/src/components/king-kingdom/FeatureIcon.tsx": "Wrapper component rendering a Lucide icon in a styled gradient container.",
  "frontend/src/components/king-kingdom/FloatingWhatsAppButton.tsx": "Fixed-position WhatsApp CTA button linking to the configured WhatsApp contact URL.",
  "frontend/src/components/king-kingdom/Footer.tsx": "Footer showing brand text, description, social links, quick links, and contact details.",
  "frontend/src/components/king-kingdom/GalleryLightbox.tsx": "Dialog-based lightbox displaying an enlarged image with a close button.",
  "frontend/src/components/king-kingdom/HeaderNav.tsx": "Sticky responsive header with text-only branding, smooth-scroll navigation, CTAs, and mobile menu.",
  "frontend/src/components/king-kingdom/sections/AboutSection.tsx": "Shows an About section describing the company's identity, services, mission, and values.",
  "frontend/src/components/king-kingdom/sections/ConstructionPhotosSection.tsx": "Displays a gallery of construction photos with a lightbox for full‑size viewing.",
  "frontend/src/components/king-kingdom/sections/ContactSection.tsx": "Provides a contact form with validation plus address, phone, WhatsApp, and email details.",
  "frontend/src/components/king-kingdom/sections/HeroSection.tsx": "Hero section with intro text, service highlights, and buttons that scroll to contact or portfolio sections.",
  "frontend/src/components/king-kingdom/sections/HighlightsSection.tsx": "Shows four feature highlight cards with icons describing key service strengths.",
  "frontend/src/components/king-kingdom/sections/MaterialsSection.tsx": "Empty placeholder file for a materials-related section component.",
  "frontend/src/components/king-kingdom/sections/PortfolioSection.tsx": "Renders a portfolio grid displaying project images, titles, and locations.",
  "frontend/src/components/king-kingdom/sections/ProcessSection.tsx": "Shows a six‑step explanation of the company’s construction workflow.",
  "frontend/src/components/king-kingdom/sections/ProjectsSection.tsx": "Empty placeholder file for a projects section component.",
  "frontend/src/components/king-kingdom/sections/ServicesSection.tsx": "Displays a services grid using predefined service items with icons, titles, and descriptions.",
  "frontend/src/components/king-kingdom/sections/WhyChooseSection.tsx": "Renders a list of reasons to choose the company, each with an icon, title, and description in a styled grid.",
  "frontend/src/components/king-kingdom/TopBar.tsx": "Renders a top navigation bar showing phone numbers, WhatsApp, email, hours, and address using CONTACT_INFO.",
  "frontend/src/config/contact.ts": "Defines central contact information including phone numbers, WhatsApp, email, address, and business hours.",
  "frontend/src/config/socialLinks.ts": "Provides social media link configuration and a helper to return only active links with valid URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for the King Kingdom design system.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges Tailwind class names using clsx and twMerge.",
  "frontend/src/lib/whatsapp.ts": "Builds and opens WhatsApp message URLs using configured contact data.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Stores project metadata, existing feature states, and pending requests related to removing CCS branding."
}