{
  "backend/main.mo": "Actor stores contact details and lead forms with queries for retrieval and a method to submit new leads.",
  "feature_evidence.json": "Feature evidence report documenting branding consistency requirements and related components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend components and sections for the King Kingdom website.",
  "frontend/index.css": "Tailwind CSS setup defining design tokens for light and dark themes with global base styles.",
  "frontend/index.html": "HTML entry file setting metadata, favicon, fonts, and mounting point for the React app.",
  "frontend/src/App.tsx": "Main React app composing all King Kingdom sections, footer, and floating WhatsApp button.",
  "frontend/src/components/king-kingdom/contact/PhoneNumberLinks.tsx": "Displays a list of phone numbers with optional icon and separator using CONTACT_INFO.",
  "frontend/src/components/king-kingdom/cta/CallNowButton.tsx": "Empty placeholder component file.",
  "frontend/src/components/king-kingdom/cta/WhatsAppButton.tsx": "Empty placeholder component file.",
  "frontend/src/components/king-kingdom/FeatureIcon.tsx": "Reusable icon wrapper for Lucide icons with styled container.",
  "frontend/src/components/king-kingdom/FloatingWhatsAppButton.tsx": "Fixed WhatsApp CTA button linking to configured WhatsApp URL.",
  "frontend/src/components/king-kingdom/Footer.tsx": "Footer showing branding, quick links, contact info, and dynamic social icons.",
  "frontend/src/components/king-kingdom/GalleryLightbox.tsx": "Lightbox modal for viewing gallery images with close button.",
  "frontend/src/components/king-kingdom/HeaderNav.tsx": "Sticky navigation bar with logo, section scroll links, CTAs, and mobile menu behavior.",
  "frontend/src/components/king-kingdom/sections/AboutSection.tsx": "Shows an About section describing CCS, its mission, vision, and values in two info cards.",
  "frontend/src/components/king-kingdom/sections/ConstructionPhotosSection.tsx": "Displays a construction photo gallery with clickable images that open in a lightbox.",
  "frontend/src/components/king-kingdom/sections/ContactSection.tsx": "Provides a contact form with validation and WhatsApp submission plus company contact details.",
  "frontend/src/components/king-kingdom/sections/HeroSection.tsx": "Hero section with main headline, service summary, and buttons that scroll to contact or portfolio sections.",
  "frontend/src/components/king-kingdom/sections/HighlightsSection.tsx": "Renders four highlight feature cards showcasing construction strengths like quality and team.",
  "frontend/src/components/king-kingdom/sections/MaterialsSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/king-kingdom/sections/PortfolioSection.tsx": "Shows a grid of portfolio projects with images, titles, and locations.",
  "frontend/src/components/king-kingdom/sections/ProcessSection.tsx": "Displays a six-step workflow explaining the construction process from contact to handover.",
  "frontend/src/components/king-kingdom/sections/ProjectsSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/king-kingdom/sections/ServicesSection.tsx": "Renders a services grid listing various construction-related offerings with icons, titles, and descriptions.",
  "frontend/src/components/king-kingdom/sections/WhyChooseSection.tsx": "Displays reasons to choose the company using a grid of icons, titles, and descriptions within a styled section.",
  "frontend/src/components/king-kingdom/TopBar.tsx": "Renders a top contact bar with phone numbers, WhatsApp, email, hours, and address using CONTACT_INFO.",
  "frontend/src/config/contact.ts": "Defines centralized contact information including phone numbers, WhatsApp, email, address, and business hours.",
  "frontend/src/config/socialLinks.ts": "Provides social media link configurations and a helper to return only active links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook managing identity state, login, and logout.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom CSS variables, color tokens, and utility classes for the app theme.",
  "frontend/src/lib/utils.ts": "Exports a helper function for merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/lib/whatsapp.ts": "Builds and opens WhatsApp message URLs using configured contact info.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, containers, animations, and plugins.",
  "project_state.json": "Stores project metadata including versioning, feature tracking, logo requirements, and project settings."
}