{
  "backend/main.mo": "Motoko actor defining ContactDetails and LeadForm types with persistent storage for lead submissions, providing query endpoints for contact info and leads, and a shared function to submit new lead forms keyed by name+phone+city.",
  "feature_evidence.json": "Feature evidence report documenting the removal of background image from HeroSection.tsx, replacing it with solid/gradient background while preserving content and styling.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App.tsx composition, TopBar, HeaderNav with logo, HeroSection with gradient, service/project sections, contact forms, footer, and utility components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with meta tags for \"Group of King Kingdom | Complete Construction Solutions (CCS)\", favicon links, Inter font preload, and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app component composing the full page layout with TopBar, HeaderNav, all section components (Hero, Highlights, About, Services, Portfolio, Gallery, WhyChoose, Process, Contact), Footer, and FloatingWhatsAppButton.",
  "frontend/src/components/king-kingdom/contact/PhoneNumberLinks.tsx": "Reusable component that renders multiple phone numbers from CONTACT_INFO config with optional icon, custom separator, and hover styling.",
  "frontend/src/components/king-kingdom/cta/CallNowButton.tsx": "Empty file placeholder for a call-to-action button component.",
  "frontend/src/components/king-kingdom/cta/WhatsAppButton.tsx": "Empty file placeholder for a WhatsApp button component.",
  "frontend/src/components/king-kingdom/FeatureIcon.tsx": "Reusable component rendering a Lucide icon within a rounded gradient background container with navy theming and configurable className.",
  "frontend/src/components/king-kingdom/FloatingWhatsAppButton.tsx": "Fixed-position floating WhatsApp button in bottom-right corner with green background, WhatsApp icon, and link to CONTACT_INFO.whatsapp.url.",
  "frontend/src/components/king-kingdom/Footer.tsx": "Footer component with CCS logo and branding, quick links with smooth scroll, contact details, dynamic social media icons from config, and Caffeine.ai attribution with current year.",
  "frontend/src/components/king-kingdom/GalleryLightbox.tsx": "Dialog-based lightbox component for displaying full-size images with dark overlay, close button, and responsive max dimensions.",
  "frontend/src/components/king-kingdom/HeaderNav.tsx": "Sticky header with CCS logo/branding, smooth-scroll navigation links (Home/About/Services/Projects/Contact), Call Now and WhatsApp CTA buttons, mobile hamburger menu, and scroll-based shadow effect.",
  "frontend/src/components/king-kingdom/sections/AboutSection.tsx": "About section displaying company information, mission/vision/values, and brand promise for Complete Construction Solutions under King Kingdom group.",
  "frontend/src/components/king-kingdom/sections/ConstructionPhotosSection.tsx": "Gallery section displaying 6 construction project images in a responsive grid with lightbox functionality for full-size viewing.",
  "frontend/src/components/king-kingdom/sections/ContactSection.tsx": "Contact form section with validation that submits inquiries via WhatsApp, alongside company contact information display.",
  "frontend/src/components/king-kingdom/sections/HeroSection.tsx": "Hero banner with gradient background, company tagline, service highlights, and CTA buttons for quotation and portfolio navigation.",
  "frontend/src/components/king-kingdom/sections/HighlightsSection.tsx": "Four-column grid showcasing key company highlights (complete construction, quality, skilled team, on-time delivery) with icons and descriptions.",
  "frontend/src/components/king-kingdom/sections/MaterialsSection.tsx": "Empty file placeholder for a materials/supplies section component.",
  "frontend/src/components/king-kingdom/sections/PortfolioSection.tsx": "Portfolio grid displaying 6 completed construction projects with images, titles, and location details in a responsive card layout.",
  "frontend/src/components/king-kingdom/sections/ProcessSection.tsx": "Six-step process section explaining the construction workflow from initial contact to final handover with numbered cards.",
  "frontend/src/components/king-kingdom/sections/ProjectsSection.tsx": "Empty file placeholder for a projects section component.",
  "frontend/src/components/king-kingdom/sections/ServicesSection.tsx": "Displays a grid of 8 construction services (house construction, renovation, grey structure, interior design, etc.) with icons, titles, and descriptions in a responsive card layout.",
  "frontend/src/components/king-kingdom/sections/WhyChooseSection.tsx": "Renders a navy gradient section showcasing 6 reasons to choose King Kingdom (experienced team, quality work, transparent pricing, etc.) with icons and descriptions.",
  "frontend/src/components/king-kingdom/TopBar.tsx": "Top navigation bar component displaying contact information (phone numbers, WhatsApp, email, hours, address) with responsive layout and hover effects.",
  "frontend/src/config/contact.ts": "Centralized configuration object containing all contact information including phone numbers, WhatsApp details, email, address, and business hours.",
  "frontend/src/config/socialLinks.ts": "Defines social media links configuration (Facebook, Instagram, YouTube, LinkedIn) with a helper function to filter active links.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom King Kingdom navy theme colors, typography settings, component classes for buttons/cards, and utility classes.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional CSS class name composition.",
  "frontend/src/lib/whatsapp.ts": "Helper functions to build WhatsApp URLs with pre-filled messages and open WhatsApp in a new window.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom navy colors, border radius variables, box shadows, animations, and typography settings for the King Kingdom brand.",
  "project_state.json": "Project metadata tracking one completed feature to remove the hero section background image and replace it with solid color/gradient."
}