{
  "backend/main.mo": "Motoko actor storing contact details and lead forms with queries for reading leads and a mutation to submit new ones.",
  "feature_evidence.json": "Feature evidence report linking footer branding updates to related components, files, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend components and their roles in the King Kingdom site.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark mode values, and base element styles.",
  "frontend/index.html": "Base HTML document loading fonts, icons, metadata, and the React app entry script.",
  "frontend/src/App.tsx": "Main React layout composing all King Kingdom sections along with header, footer, and floating WhatsApp button.",
  "frontend/src/components/king-kingdom/contact/PhoneNumberLinks.tsx": "Displays a list of phone numbers from CONTACT_INFO with optional icon and separator.",
  "frontend/src/components/king-kingdom/cta/CallNowButton.tsx": "Empty placeholder component file.",
  "frontend/src/components/king-kingdom/cta/WhatsAppButton.tsx": "Empty placeholder component file.",
  "frontend/src/components/king-kingdom/FeatureIcon.tsx": "Reusable wrapper that renders a Lucide icon inside a styled gradient container.",
  "frontend/src/components/king-kingdom/FloatingWhatsAppButton.tsx": "Fixed WhatsApp action button linking to the configured WhatsApp URL.",
  "frontend/src/components/king-kingdom/Footer.tsx": "Footer displaying CCS logo, branding text, description, quick links, and social icons with smooth-scroll handling.",
  "frontend/src/components/king-kingdom/GalleryLightbox.tsx": "Dialog-based image lightbox with close button and centered responsive image display.",
  "frontend/src/components/king-kingdom/HeaderNav.tsx": "Sticky responsive header with logo, navigation links, call/WhatsApp CTAs, and mobile menu behavior.",
  "frontend/src/components/king-kingdom/sections/AboutSection.tsx": "Section describing the company, its mission, values, and construction services.",
  "frontend/src/components/king-kingdom/sections/ConstructionPhotosSection.tsx": "Displays a photo gallery with lightbox functionality for construction project images.",
  "frontend/src/components/king-kingdom/sections/ContactSection.tsx": "Contact form and company details section using validation and WhatsApp submission.",
  "frontend/src/components/king-kingdom/sections/HeroSection.tsx": "Hero banner describing services and offering buttons to scroll to contact or portfolio.",
  "frontend/src/components/king-kingdom/sections/HighlightsSection.tsx": "Highlights key service features like quality, team skill, and on-time delivery.",
  "frontend/src/components/king-kingdom/sections/MaterialsSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/king-kingdom/sections/PortfolioSection.tsx": "Shows a grid of project cards with images, titles, and locations.",
  "frontend/src/components/king-kingdom/sections/ProcessSection.tsx": "Outlines the construction workflow in six steps from contact to handover.",
  "frontend/src/components/king-kingdom/sections/ProjectsSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/king-kingdom/sections/ServicesSection.tsx": "Renders a services grid showcasing construction-related offerings with icons, titles, and descriptions.",
  "frontend/src/components/king-kingdom/sections/WhyChooseSection.tsx": "Displays a list of reasons to choose the company, each with an icon, title, and description in a styled grid.",
  "frontend/src/components/king-kingdom/TopBar.tsx": "Renders a top bar with phone numbers, WhatsApp, email, hours, and address pulled from CONTACT_INFO.",
  "frontend/src/config/contact.ts": "Defines centralized contact details including phones, WhatsApp, email, address, and business hours.",
  "frontend/src/config/socialLinks.ts": "Provides social media link configurations and a helper to return only active links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, handling login, stored identities, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, component classes, and utility extensions for the site's design system.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/lib/whatsapp.ts": "Builds WhatsApp message URLs and opens them using contact configuration.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing query and identity providers before rendering the main App component.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, including colors, fonts, shadows, animations, and plugin usage.",
  "project_state.json": "Stores project metadata, existing features, and pending feature requests for project tracking."
}