{
  "kind": "build_request",
  "title": "Add the newly uploaded logo to the header branding",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Add the newly uploaded logo (download-1.webp) as a static image asset under frontend/public/assets/generated and create a crisp, centered, square logo file suitable for web use.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Now add this logo"
        ]
      },
      "acceptanceCriteria": [
        "A new logo image file exists under frontend/public/assets/generated.",
        "The created logo is square, centered, and visually clean (no unintended padding/cropping), and renders crisply on mobile and desktop.",
        "The app builds successfully after adding the new asset."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update the sticky header brand area (frontend/src/components/king-kingdom/HeaderNav.tsx) to display the new logo image alongside the existing brand text (\"King Kingdom\" and \"Complete Construction Solutions\"), ensuring the logo is not stretched or cropped and remains well-aligned and responsive on small screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Now add this logo"
        ]
      },
      "acceptanceCriteria": [
        "The header shows the new logo next to the brand text on desktop and mobile.",
        "The logo maintains correct aspect ratio (no stretching), is not visibly cropped, and stays aligned with the text baseline/stack.",
        "Header layout remains responsive: brand area does not overflow or cause the navigation/CTA layout to break at common breakpoints.",
        "No other site interactions (scroll-to-section, menu toggle, Call Now, WhatsApp CTAs) regress."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Store and reference logo images as static assets under frontend/public/assets/generated (do not route images through the backend).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Backend changes (Motoko) are out of scope.",
    "Changing phone/WhatsApp URLs or contact form behavior is out of scope.",
    "Redesigning other sections of the site beyond header logo placement is out of scope."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}